In [ ]:
# WILL BE USING SQLite, DB2, FOR THIS NOTEBOOK
# AUTHOR: MIGUEL GIL
# Notes Taken from IBM Course 'Databases and SQL for DATA Science with Python'

BASICS FOR SQL AND RELATIONAL DBS

In [ ]:
# SQL = Structured Query Language

SELECT Statement: A data manipulation language(DML) statement used to read and modify data
 -is a 'Query'

In [ ]:
Select * from <table_name>
# used to select all columns from <table_name>
# Can get only needed columns with the following
Select <col_name1>, <col_name2> from <table_name>

FROM: Specifies from which table to get the data.
The clause can include optional JOIN subclauses to specify the rules for joining tables.

We can restrict the Result Set: WHERE Clause
**ALWAYS REQUIRES a __PREDICATE__
**USED TO SPECIFY ROWS TO RETRIEVE
A Predicate is an expression which evaluates to True, False || Unknown

In [ ]:
Select book_id, title from Book
    WHERE book_id='B1'
# This return set will include book_id & title ONLY for row w/ book_id = "B1"
# BETTER/ALT SYNTAX
Select book_id, title
From Book
WHERE book_id='B1'
;
# NOTE the ';' Semicolon after the SQL Statement, good habit .

USEFUL EXPRESSIONS TO USE W/ SELECT Statements

count() : A built in DB function that retrieves # of rows matching the query.
    -Normally placed @ Beginning after 'SELECT'

Distinct :Used to remove dublicate data from a RESULT SET
    -Placed Before Column Names

Limit :Used to restrict # of rows to retrieve from DB
    -placed @ end of statement after a WHERE Clause

In [ ]:
# COUNT()
# used to get count of all rows
Select COUNT(*) from TableName;

#CAN count specific rows using WHERE Clause
SELECT COUNT(COUNTRY) From MEDALS
    WHERE COUNTRY='CANADA'
    # THIS ^ statement retrieves count of specific rows

In [ ]:
# DISTINCT
# Can retirve Unique values in a column 
select DISTINCT column_name from table_name

# USING MEDALS table from ^ COUNT() example, 
# if a country recieved many gold medals and we only 
# a list of UNIQUE values of countries that received 'GOLD' Medals.
select DISTINCT from MEDALS
    WHERE MEDALTYPE='GOLD'

In [ ]:
# LIMIT
select * from tablename LIMIT 10

# CAN COMBINE W/ OFFSET to start at a specific ROW for retrival EX.
SELECT * FROM COL_NAME LIMIT 15 OFFSET 10
    # HERE our statement will retrieve the first 15 rows starting @ ROW 11

INSERT STATEMENT 
    -USED to insert data to populate table w/ data
    -For adding NEW ROWS to a table
    -Is a DML Statement
SYNTAX:
    INSERT INTO <tableName>
        <([columnName])>
    VALUES ([Value])

In [ ]:
# EXAMPLE USING INSERT 
INSERT INTO Author
    (Author_ID, Last_Name, First_Name, Email, City, Country)
VALUES('A1', 'CHONG', 'RAUL', 'ww@aol.com', 'TORONTO', 'USA')
# ** length of VALUES List and Respective Column should be = to eachother 
#    to ensure each COLUMN has a value.

# CAN ADD MULTIPLE ROWS by Specifying each ROW in VALUES Clause 
INSERT INTO Author
    (Author_ID, Last_Name, First_Name, Email, City, Country)
VALUES
    ('A1', 'CHONG', 'RAUL', 'ww@aol.com', 'TORONTO', 'USA'),
    ('A2', 'KOG', 'PAUL', 'aa@gmail.com', 'MIAMI', 'USA')

UPDATE & DELETE STATEMENTS

We can ALTER the data of a table w/ UPDATE
    -Is a DML Statement
SYNTAX UPDATE:
    UPDATE <table_name>
    SET[[column_name]=[value]]
    WHERE <condition>
SYNTAX DELETE:
    DELETE From <col_name>
    WHERE <condition>

In [ ]:
# UPDATE Statement Example
UPDATE Author
SET 
    First_Name='Aldo',
    Last_Name='Pollo'
    WHERE Author_ID='A2' 
# WHERE Clause is IMPORTANT Because all rows will be updated/altered w/out one.

In [ ]:
# DELETE Statement Example
DELETE from Author
WHERE Author_ID IN('A2', 'A3')
# **IF NO WHERE Clause is included all ROWS will be deleted
# USING IN we can supply a list of values to check for.